--- a/test-diagram.md
+++ b/test-diagram.md
@@ -1,107 +1,173 @@
-mermaid
+## mermaid
 
 ```mermaid
 graph TD
-    start
-    --> int{check int}
-        --F--> 91["not int"]
-        int--T
-    --> digitCircular{check digit}
-        -- n dont have ... digit 
-        -- if digits have ... : F
-        -- rtn T F  
-        -- 0 5
-        -- 2n
-        --> 92["not circ"]
-        digitCircular--T
-    --> isPrime{check prime}
+    input
+    --> 1{check int}
+        --F--> 91[rtn: not int]
+        1--T
+    --> 2{check digits}
+        -- F
+        --> 92[rtn: not circ]
+        2--T
+    --> 3{check prime}
         --F--> 92
-        isPrime--T
-    --> digitRotate{check rotate}
+        3--T
+    --> 4{check rotate}
         --F--> 92
-        digitRotate--T
-    --> 90[n]
+        4--T
+    --> 90[rtn: n]
 ```
 
 ---
-PlantUML
@@
 
+## uml-simple
+
 ```puml
 start
-- check int
-    if (is int) then (F)
-        ->
-        - rtn: not int
+
+- n
+if (check int) then
         stop
     else (T)
-    - rtn n
-    endif
-- check digit
-    note right
-        check 0 5
-        * 59
-        * 509
-        check 2n: 2 4 6 8
-        * 29
-        * 69
-    end note
-    if (dont have) then (F)
-        - rtn: not circ
+if (check digit) then
         stop
     else (T)
-    endif
-- check prime
-    if (is prime) then (F)
-        - rtn: not circ
+if (check prime) then
         stop
     else (T)
-- check rotate 
-    if (not rotate) then (F)
-        - rtn: not circ
+if (check rotate) then
         stop
     else (T)
-    endif
-- rtn n
+- n
+
 stop
 ```
 
+---
+
+## uml-detailed
+
+```puml
+start
+
+- check int
+    if (type(n) == int) then(T)
+    else
+        -> F, rtn "not int";
+        stop
+    endif
+- check digit
+    note right
+        0, 5
+        * 509 -> 950, 95
+        2, 4, 6, 8 - 2n
+        * 29 -> 92
+    end note
+    -> n not have(0, 5, 2n);
+    if (digit % x != 0) then(T)
+    else
+        -> rtn: not circ;
+        stop
+    endif
+- check prime
+    if (is_prime(n) == T) then (T)
+    else
+        stop
+    endif
+- check rotate
+-> rotate[bac, cba] are prime;
+    if (is_prime(rotate) == T) then (T)
+    else
+        stop
+    endif
+-> rtn n;
+
+stop
+```
+
+---
+
